In [1]:
import pandas as pd
url ='https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%205/data/addresses.csv'
df = pd.read_csv(url)
df

,John,Doe,120 jefferson st.,Riverside,NJ,08075
0,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
1,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
2,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
3,NaN,Blankman,NaN,SomeTown,SD,298
4,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [3]:
df.columns = ['First Name', 'Last Name', 'Location', 'City', 'State', 'Area Code']
df

,First Name,Last Name,Location,City,State,Area Code
0,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
1,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
2,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
3,NaN,Blankman,NaN,SomeTown,SD,298
4,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [5]:
df['First Name']

0                     Jack
1            John "Da Man"
2                  Stephen
3                      NaN
4    Joan "the bone", Anne
Name: First Name, dtype: object

In [8]:
df = df[['First Name', 'Last Name', 'Location', 'City','State','Area Code']]
df

,First Name,Last Name,Location,City,State,Area Code
0,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
1,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
2,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
3,NaN,Blankman,NaN,SomeTown,SD,298
4,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [10]:
df.loc[0]

First Name            Jack
Last Name         McGinnis
Location      220 hobo Av.
City                 Phila
State                   PA
Area Code             9119
Name: 0, dtype: object

In [12]:
df.loc[[0,1,2], 'First Name']

0             Jack
1    John "Da Man"
2          Stephen
Name: First Name, dtype: object

In [13]:
df.iloc[[0,1,2], 0]

0             Jack
1    John "Da Man"
2          Stephen
Name: First Name, dtype: object

In [16]:
import pandas as pd
import numpy as np
df  = pd.DataFrame(np.array([[1,2,3],[4,5,6], [7,8,9]]), columns=['a', 'b', 'c'])
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [17]:
df = df.transform(func = lambda x : x + 10)
df

    a   b   c
0  11  12  13
1  14  15  16
2  17  18  19

In [18]:
result = df.transform(func = ['sqrt'])
result

          a         b         c
       sqrt      sqrt      sqrt
0  3.316625  3.464102  3.605551
1  3.741657  3.872983  4.000000
2  4.123106  4.242641  4.358899